In [2]:
!pip install mysql

Collecting mysql
  Downloading mysql-0.0.3-py3-none-any.whl (1.2 kB)
Collecting mysqlclient
  Downloading mysqlclient-2.1.1-cp39-cp39-win_amd64.whl (178 kB)
Installing collected packages: mysqlclient, mysql
Successfully installed mysql-0.0.3 mysqlclient-2.1.1

In [4]:
!pip install mysql.connector

Collecting mysql.connector
  Downloading mysql-connector-2.2.9.tar.gz (11.9 MB)
Building wheels for collected packages: mysql.connector
  Building wheel for mysql.connector (setup.py): started
  Building wheel for mysql.connector (setup.py): finished with status 'done'
  Created wheel for mysql.connector: filename=mysql_connector-2.2.9-cp39-cp39-win_amd64.whl size=247961 sha256=bc95861d7823e06e7ab4eabd3f817583c4bce5cf2819f661627b94817892a409
  Stored in directory: c:\users\91630\appdata\local\pip\cache\wheels\7b\14\39\5aad423666e827dfe9a1fbcd111ac17171e7c9865d570780ce
Successfully built mysql.connector
Installing collected packages: mysql.connector
Successfully installed mysql.connector-2.2.9

In [1]:
#import libaries
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [2]:
conn=mysql.connector.connect(host='localhost',user='root',password='123456',database='venky',
                             auth_plugin='mysql_native_password')
if conn.is_connected():
    print('connection successfully')
else:
    print('connection failed')

connection successfully

In [3]:
def create_server_connection(host_name,user_name,user_password):
    connection=None
    try:
        connection=mysql.connector.connect(host=host_name,user=user_name,passwd=user_password,
                                           auth_plugin='mysql_native_password')
        print('MYSQL Database Connection Successful')
    except Error as err:
        print(f"Error:'{err}'")
    return connection

#put our mysql terminal password
pw='123456'

#database name
db='mysql_python'

connection=create_server_connection('localhost','root',pw)

MYSQL Database Connection Successful

In [48]:
#Create mysql_python
def create_database(connection,query):
    cursor=connection.cursor()
    try:
        cursor.execute(query)
        print('Database create Successfully')
    except Error as err:
        print(f"Error:'{err}'")
        
create_database_query='Create database mysql_python'
create_database(connection,create_database_query)

Database create Successfully

In [15]:
#connect to database
def create_db_connection(host_name,user_name,user_password,db_name):
    connection = None
    try:
        connection=mysql.connector.connect(host=host_name,user=user_name,passwd=user_password,database=db_name,
                                          auth_plugin='mysql_native_password')
        print('MYSQL Database Connection Successfully')
    except Error as err:
        print(f"Error:'{err}'")
    return connection

In [16]:
#Execute sql queries
def execute_query(connection,query):
    cursor=connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print('Query was Successfull')
    except Error as err:
        print(f"Error:'{err}'")

In [26]:
#create the table
create_order_table="""
create table flipkartorders(
order_id int primary key,
customer_name varchar(30) not null,
product_name varchar(30) not null,
date_ordered date,
quantity int,
unit_price float,
phone_number varchar(20));
"""

#connection to the database
connection=create_db_connection('localhost','root',pw,db)
execute_query(connection,create_order_table)

MYSQL Database Connection Successfully
Query was Successfull

In [30]:
#insert data
date_orders="""
insert into orders values
(121, 'venky','laptop','2018-08-07',2,800,'8292898928'),
(122, 'shyam','Books','2018-04-17',10,12,'4849849389'),
(123, 'chandu','dress','2018-03-24',38,28,'9128395784'),
(124, 'kishore','shoes','2018-03-20',18,38,'9128473829'),
(125, 'vinay','headphones','2018-08-10',10,300,'6303444038');
"""

connection=create_db_connection('localhost','root',pw,db)
execute_query(connection,date_orders)

MYSQL Database Connection Successfully
Query was Successfull

In [31]:
def read_query(connection,query):
    cursor=connection.cursor()
    result=None
    try:
        cursor.execute(query)
        result=cursor.fetchall()
        return result
    except Error as err:
        print(f"Error:'{err}'")

In [33]:
#using the select statement
q1="""
select * from orders;
"""
connection=create_db_connection('localhost','root',pw,db)
results=read_query(connection,q1)
for result in results:
    print(result)

MYSQL Database Connection Successfully
(11, 'venky', 'laptop', datetime.date(2018, 8, 7), 2, 800.0, '8292898928')
(12, 'shyam', 'Books', datetime.date(2018, 4, 17), 10, 12.0, '4849849389')
(13, 'chandu', 'dress', datetime.date(2018, 3, 24), 38, 28.0, '9128395784')
(14, 'kishore', 'shoes', datetime.date(2018, 3, 20), 18, 38.0, '9128473829')
(15, 'vinay', 'headphones', datetime.date(2018, 8, 10), 10, 300.0, '6303444038')
(101, 'venky', 'laptop', datetime.date(2018, 8, 7), 2, 800.0, '8292898928')
(102, 'shyam', 'Books', datetime.date(2018, 4, 17), 10, 12.0, '4849849389')
(103, 'chandu', 'dress', datetime.date(2018, 3, 24), 38, 28.0, '9128395784')
(104, 'kishore', 'shoes', datetime.date(2018, 3, 20), 18, 38.0, '9128473829')
(105, 'vinay', 'headphones', datetime.date(2018, 8, 10), 10, 300.0, '6303444038')
(111, 'venky', 'laptop', datetime.date(2018, 8, 7), 2, 800.0, '8292898928')
(112, 'shyam', 'Books', datetime.date(2018, 4, 17), 10, 12.0, '4849849389')
(113, 'chandu', 'dress', datetime.date(2018, 3, 24), 38, 28.0, '9128395784')
(114, 'kishore', 'shoes', datetime.date(2018, 3, 20), 18, 38.0, '9128473829')
(115, 'vinay', 'headphones', datetime.date(2018, 8, 10), 10, 300.0, '6303444038')
(121, 'venky', 'laptop', datetime.date(2018, 8, 7), 2, 800.0, '8292898928')
(122, 'shyam', 'Books', datetime.date(2018, 4, 17), 10, 12.0, '4849849389')
(123, 'chandu', 'dress', datetime.date(2018, 3, 24), 38, 28.0, '9128395784')
(124, 'kishore', 'shoes', datetime.date(2018, 3, 20), 18, 38.0, '9128473829')
(125, 'vinay', 'headphones', datetime.date(2018, 8, 10), 10, 300.0, '6303444038')

In [36]:
#using the select statement
q2="""
select customer_name,phone_number from orders;
"""
connection=create_db_connection('localhost','root',pw,db)
results=read_query(connection,q2)
for result in results:
    print(result)

MYSQL Database Connection Successfully
('venky', '8292898928')
('shyam', '4849849389')
('chandu', '9128395784')
('kishore', '9128473829')
('vinay', '6303444038')
('venky', '8292898928')
('shyam', '4849849389')
('chandu', '9128395784')
('kishore', '9128473829')
('vinay', '6303444038')
('venky', '8292898928')
('shyam', '4849849389')
('chandu', '9128395784')
('kishore', '9128473829')
('vinay', '6303444038')
('venky', '8292898928')
('shyam', '4849849389')
('chandu', '9128395784')
('kishore', '9128473829')
('vinay', '6303444038')

In [37]:
#using the select statement
q3="""
select year(date_ordered) from orders;
"""
connection=create_db_connection('localhost','root',pw,db)
results=read_query(connection,q3)
for result in results:
    print(result)

MYSQL Database Connection Successfully
(2018,)
(2018,)
(2018,)
(2018,)
(2018,)
(2018,)
(2018,)
(2018,)
(2018,)
(2018,)
(2018,)
(2018,)
(2018,)
(2018,)
(2018,)
(2018,)
(2018,)
(2018,)
(2018,)
(2018,)

In [38]:
#using the select statement
q4="""
select distinct year(date_ordered) from orders;
"""
connection=create_db_connection('localhost','root',pw,db)
results=read_query(connection,q4)
for result in results:
    print(result)

MYSQL Database Connection Successfully
(2018,)

In [39]:
#using the select statement
q5="""
select * from orders where date_ordered < '2018-04-17';
"""
connection=create_db_connection('localhost','root',pw,db)
results=read_query(connection,q5)
for result in results:
    print(result)

MYSQL Database Connection Successfully
(13, 'chandu', 'dress', datetime.date(2018, 3, 24), 38, 28.0, '9128395784')
(14, 'kishore', 'shoes', datetime.date(2018, 3, 20), 18, 38.0, '9128473829')
(103, 'chandu', 'dress', datetime.date(2018, 3, 24), 38, 28.0, '9128395784')
(104, 'kishore', 'shoes', datetime.date(2018, 3, 20), 18, 38.0, '9128473829')
(113, 'chandu', 'dress', datetime.date(2018, 3, 24), 38, 28.0, '9128395784')
(114, 'kishore', 'shoes', datetime.date(2018, 3, 20), 18, 38.0, '9128473829')
(123, 'chandu', 'dress', datetime.date(2018, 3, 24), 38, 28.0, '9128395784')
(124, 'kishore', 'shoes', datetime.date(2018, 3, 20), 18, 38.0, '9128473829')

In [40]:
#using the select statement
q6="""
select * from orders where date_ordered > '2018-04-17';
"""
connection=create_db_connection('localhost','root',pw,db)
results=read_query(connection,q6)
for result in results:
    print(result)

MYSQL Database Connection Successfully
(11, 'venky', 'laptop', datetime.date(2018, 8, 7), 2, 800.0, '8292898928')
(15, 'vinay', 'headphones', datetime.date(2018, 8, 10), 10, 300.0, '6303444038')
(101, 'venky', 'laptop', datetime.date(2018, 8, 7), 2, 800.0, '8292898928')
(105, 'vinay', 'headphones', datetime.date(2018, 8, 10), 10, 300.0, '6303444038')
(111, 'venky', 'laptop', datetime.date(2018, 8, 7), 2, 800.0, '8292898928')
(115, 'vinay', 'headphones', datetime.date(2018, 8, 10), 10, 300.0, '6303444038')
(121, 'venky', 'laptop', datetime.date(2018, 8, 7), 2, 800.0, '8292898928')
(125, 'vinay', 'headphones', datetime.date(2018, 8, 10), 10, 300.0, '6303444038')

In [41]:
#using the select statement
q5="""
select * from orders order by unit_price;
"""
connection=create_db_connection('localhost','root',pw,db)
results=read_query(connection,q5)
for result in results:
    print(result)

MYSQL Database Connection Successfully
(12, 'shyam', 'Books', datetime.date(2018, 4, 17), 10, 12.0, '4849849389')
(102, 'shyam', 'Books', datetime.date(2018, 4, 17), 10, 12.0, '4849849389')
(112, 'shyam', 'Books', datetime.date(2018, 4, 17), 10, 12.0, '4849849389')
(122, 'shyam', 'Books', datetime.date(2018, 4, 17), 10, 12.0, '4849849389')
(13, 'chandu', 'dress', datetime.date(2018, 3, 24), 38, 28.0, '9128395784')
(103, 'chandu', 'dress', datetime.date(2018, 3, 24), 38, 28.0, '9128395784')
(113, 'chandu', 'dress', datetime.date(2018, 3, 24), 38, 28.0, '9128395784')
(123, 'chandu', 'dress', datetime.date(2018, 3, 24), 38, 28.0, '9128395784')
(14, 'kishore', 'shoes', datetime.date(2018, 3, 20), 18, 38.0, '9128473829')
(104, 'kishore', 'shoes', datetime.date(2018, 3, 20), 18, 38.0, '9128473829')
(114, 'kishore', 'shoes', datetime.date(2018, 3, 20), 18, 38.0, '9128473829')
(124, 'kishore', 'shoes', datetime.date(2018, 3, 20), 18, 38.0, '9128473829')
(15, 'vinay', 'headphones', datetime.date(2018, 8, 10), 10, 300.0, '6303444038')
(105, 'vinay', 'headphones', datetime.date(2018, 8, 10), 10, 300.0, '6303444038')
(115, 'vinay', 'headphones', datetime.date(2018, 8, 10), 10, 300.0, '6303444038')
(125, 'vinay', 'headphones', datetime.date(2018, 8, 10), 10, 300.0, '6303444038')
(11, 'venky', 'laptop', datetime.date(2018, 8, 7), 2, 800.0, '8292898928')
(101, 'venky', 'laptop', datetime.date(2018, 8, 7), 2, 800.0, '8292898928')
(111, 'venky', 'laptop', datetime.date(2018, 8, 7), 2, 800.0, '8292898928')
(121, 'venky', 'laptop', datetime.date(2018, 8, 7), 2, 800.0, '8292898928')

In [42]:
from_db=[]

for result in results:
    result=list(result)
    from_db.append(result)
columns=['order_id','customer_name','product_name','date_ordered','quantity','unit_price','phone_number']
df=pd.DataFrame(from_db,columns=columns)
display(df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,12,shyam,Books,2018-04-17,10,12.0,4849849389
1,102,shyam,Books,2018-04-17,10,12.0,4849849389
2,112,shyam,Books,2018-04-17,10,12.0,4849849389
3,122,shyam,Books,2018-04-17,10,12.0,4849849389
4,13,chandu,dress,2018-03-24,38,28.0,9128395784
5,103,chandu,dress,2018-03-24,38,28.0,9128395784
6,113,chandu,dress,2018-03-24,38,28.0,9128395784
7,123,chandu,dress,2018-03-24,38,28.0,9128395784
8,14,kishore,shoes,2018-03-20,18,38.0,9128473829
9,104,kishore,shoes,2018-03-20,18,38.0,9128473829
10,114,kishore,shoes,2018-03-20,18,38.0,9128473829
11,124,kishore,shoes,2018-03-20,18,38.0,9128473829
12,15,vinay,headphones,2018-08-10,10,300.0,6303444038
13,105,vinay,headphones,2018-08-10,10,300.0,6303444038
14,115,vinay,headphones,2018-08-10,10,300.0,6303444038
15,125,vinay,headphones,2018-08-10,10,300.0,6303444038
16,11,venky,laptop,2018-08-07,2,800.0,8292898928
17,101,venky,laptop,2018-08-07,2,800.0,8292898928
18,111,venky,laptop,2018-08-07,2,800.0,8292898928
19,121,venky,laptop,2018-08-07,2,800.0,8292898928

In [43]:
#update command
update=""" 
update orders 
set unit_price=45
where order_id=14
"""
connection=create_db_connection('localhost','root',pw,db)
execute_query(connection,update)

MYSQL Database Connection Successfully
Query was Successfull

In [50]:
q8="""
select * from orders where order_id =103;
"""
connection=create_db_connection('localhost','root',pw,db)
results=read_query(connection,q8)
for result in results:
    print(result)

MYSQL Database Connection Successfully
(103, 'chandu', 'dress', datetime.date(2018, 3, 24), 38, 28.0, '9128395784')

In [51]:
#delete command
delete_order="""
delete from orders
where order_id=115;
"""
connection=create_db_connection('localhost','root',pw,db)
execute_query(connection,delete_order)

MYSQL Database Connection Successfully
Query was Successfull

In [52]:
q9="""
select * from orders;
"""
connection=create_db_connection('localhost','root',pw,db)
results=read_query(connection,q9)
for result in results:
    print(result)

MYSQL Database Connection Successfully
(11, 'venky', 'laptop', datetime.date(2018, 8, 7), 2, 800.0, '8292898928')
(12, 'shyam', 'Books', datetime.date(2018, 4, 17), 10, 12.0, '4849849389')
(13, 'chandu', 'dress', datetime.date(2018, 3, 24), 38, 28.0, '9128395784')
(14, 'kishore', 'shoes', datetime.date(2018, 3, 20), 18, 45.0, '9128473829')
(15, 'vinay', 'headphones', datetime.date(2018, 8, 10), 10, 300.0, '6303444038')
(101, 'venky', 'laptop', datetime.date(2018, 8, 7), 2, 800.0, '8292898928')
(102, 'shyam', 'Books', datetime.date(2018, 4, 17), 10, 12.0, '4849849389')
(103, 'chandu', 'dress', datetime.date(2018, 3, 24), 38, 28.0, '9128395784')
(104, 'kishore', 'shoes', datetime.date(2018, 3, 20), 18, 38.0, '9128473829')
(105, 'vinay', 'headphones', datetime.date(2018, 8, 10), 10, 300.0, '6303444038')
(111, 'venky', 'laptop', datetime.date(2018, 8, 7), 2, 800.0, '8292898928')
(112, 'shyam', 'Books', datetime.date(2018, 4, 17), 10, 12.0, '4849849389')
(113, 'chandu', 'dress', datetime.date(2018, 3, 24), 38, 28.0, '9128395784')
(114, 'kishore', 'shoes', datetime.date(2018, 3, 20), 18, 38.0, '9128473829')
(121, 'venky', 'laptop', datetime.date(2018, 8, 7), 2, 800.0, '8292898928')
(122, 'shyam', 'Books', datetime.date(2018, 4, 17), 10, 12.0, '4849849389')
(123, 'chandu', 'dress', datetime.date(2018, 3, 24), 38, 28.0, '9128395784')
(124, 'kishore', 'shoes', datetime.date(2018, 3, 20), 18, 38.0, '9128473829')
(125, 'vinay', 'headphones', datetime.date(2018, 8, 10), 10, 300.0, '6303444038')